; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	infrared0 - mode
	spectrograph1 - mode
	GroundStation1 - direction
	GroundStation8 - direction
	GroundStation4 - direction
	Star0 - direction
	Star2 - direction
	Star6 - direction
	Star3 - direction
	Star7 - direction
	GroundStation5 - direction
	Planet9 - direction
	Phenomenon10 - direction
	Planet11 - direction
	Star12 - direction
	Star13 - direction
)
(:init
	(supports instrument0 infrared0)
	(calibration_target instrument0 GroundStation5)
	(supports instrument1 infrared0)
	(supports instrument1 spectrograph1)
	(calibration_target instrument1 Star3)
	(calibration_target instrument1 Star0)
	(calibration_target instrument1 GroundStation4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet11)
	(supports instrument2 spectrograph1)
	(supports instrument2 infrared0)
	(calibration_target instrument2 Star6)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation4)
	(supports instrument3 infrared0)
	(calibration_target instrument3 Star6)
	(calibration_target instrument3 Star2)
	(supports instrument4 spectrograph1)
	(supports instrument4 infrared0)
	(calibration_target instrument4 Star3)
	(supports instrument5 infrared0)
	(calibration_target instrument5 GroundStation5)
	(calibration_target instrument5 Star7)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star12)
)
(:goal (and
	(pointing satellite1 Planet11)
	(have_image Planet9 spectrograph1)
	(have_image Phenomenon10 spectrograph1)
	(have_image Planet11 spectrograph1)
	(have_image Star12 spectrograph1)
	(have_image Star13 spectrograph1)
))

)

; plan
1. (turn_to satellite1 star6 groundstation4)
   deleted: (pointing satellite1 groundstation4)
   added: (pointing satellite1 star6)
   goals met: 0 of 6
2. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 6
3. (calibrate satellite1 instrument2 star6)
   added: (calibrated instrument2)
   goals met: 0 of 6
4. (turn_to satellite1 star12 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 star12)
   goals met: 0 of 6
5. (take_image satellite1 star12 instrument2 spectrograph1)
   added: (have_image star12 spectrograph1)
   goals met: 1 of 6
6. (turn_to satellite1 planet9 star12)
   deleted: (pointing satellite1 star12)
   added: (pointing satellite1 planet9)
   goals met: 1 of 6
7. (take_image satellite1 planet9 instrument2 spectrograph1)
   added: (have_image planet9 spectrograph1)
   goals met: 2 of 6
8. (turn_to satellite1 phenomenon10 planet9)
   deleted: (pointing satellite1 planet9)
   added: (pointing satellite1 phenomenon10)
   goals met: 2 of 6
9. (take_image satellite1 phenomenon10 instrument2 spectrograph1)
   added: (have_image phenomenon10 spectrograph1)
   goals met: 3 of 6
10. (turn_to satellite1 star13 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 star13)
   goals met: 3 of 6
11. (take_image satellite1 star13 instrument2 spectrograph1)
   added: (have_image star13 spectrograph1)
   goals met: 4 of 6
12. (turn_to satellite1 planet11 star13)
   deleted: (pointing satellite1 star13)
   added: (pointing satellite1 planet11)
   goals met: 5 of 6
13. (take_image satellite1 planet11 instrument2 spectrograph1)
   added: (have_image planet11 spectrograph1)
   goals met: 6 of 6
